Revit 2026 API

# LightNode Class

---

This class represents a Light element in a model-exporting process.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBContentNode Autodesk.Revit.DBLightNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightNode : ContentNode
```
```vb
Public Class LightNode
	Inherits ContentNode
```
```cpp
public ref class LightNode : public ContentNode
```
```fsharp
type LightNode =
    class
        inherit ContentNode
    end
```

The LightNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAsset | Returns an an instance of an Asset object, which contains definitions of the content node. (Inherited from ContentNode) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTransform | A transformation matrix associated with the node. (Inherited from ContentNode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

See also: [!:Autodesk::Revit::DB::IExportContext::OnLight].

#### Reference

Autodesk.Revit.DB Namespace